Revit 2027 API
Truss.AttachChord Method
Attach a truss's specific chord to a specified element, the element should be a roof or floor.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public void AttachChord(
	Element attachToElement,
	TrussChordLocation location,
	bool forceRemoveSketch
)
Public Sub AttachChord (
	attachToElement As Element,
	location As TrussChordLocation,
	forceRemoveSketch As Boolean
)
public:
void AttachChord(
	Element^ attachToElement,
	TrussChordLocation location,
	bool forceRemoveSketch
)
member AttachChord :
        attachToElement : Element *
        location : TrussChordLocation *
        forceRemoveSketch : bool -> unit
Parameters
attachToElement Element
The element to which the truss's chord will attach. The element should be a roof or floor.
location TrussChordLocation
The chord need to be attached.
forceRemoveSketch Boolean
Whether to detach the original sketch if there is one.
See Also
Reference
Truss Class
Autodesk.Revit.DB.Structure Namespace